{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor Computer Science (honours)",
      "department": "Department of Computer Science",
      "duration": "2017-2022",
      "school_name": "Tronto Metropolitan University"
    },
    {
      "awards_achievements": [
        "3rd place in UTSC's FinanceHacks Hackathon"
      ],
      "degree": "Environmental Science",
      "department": "Department of Physical \u0026 Environmental Science",
      "duration": "2015-2016",
      "school_name": "University of Toronto Scarborough"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AmosPivato",
  "highlighted_projects": [
    {
      "description": "Implemented a text adventure game with AI driven NPC using python class functionalities.  Designed UML architecture and class diagrams to facilitate implementation.",
      "name": "Text Adventure Python Game"
    },
    {
      "description": "Designed a level driven 3d modeled tower shooter with textures.  Implemented a full hierarchical model design for animation driven gameplay.",
      "name": "3d Robot Tower Defense Game"
    },
    {
      "description": "Designed, implemented and tested machine learning models to evaluate the accuracy of supervised machine learning for movie reccomendations.",
      "name": "Movie Reccomender System"
    }
  ],
  "jarvis_projects": [
    {
      "description": [
        "Implemented a Linux Cluster monitoring agent, using automated Bash commands, that retrieves and stores local network node hardware spec and usage data into a PSQL docker instance.",
        "Designed the database table schemas for host info and host usage node data, and business problem queries that will provide information from this stored data within the RDBMS."
      ],
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Implemented a Twitter CRD app that works with Twitters REST API to post, show or delete tweets, Springboot was used to handle app dependencies and to make sure all the apps layers functioned accordingly, and was then deployed through dockerhub as a docker image for easy distributions and execution..",
        "JDBC App: Learned and implemented JDBC CRUD app using a test Database to use a DAO design pattern for easy application and database interactions.",
        "Grep App: Implemented a GREP application using Maven in Java that could search for strings within a directories files using a matching regex pattern. Distributed over Dockerhub."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Amos Pivato",
  "others": [
    {
      "bullets": [
        "International Tawkwondo Federation Black Belt Instructor (2018)",
        "French Billingual High school Diploma (2015)",
        "Certified Standard First Aid \u0026 CPR/AED Level C (Canadian Red Cross, 2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "fluent in French and knowledgable in Spanish"
      ],
      "title": "Personal Skills"
    },
    {
      "bullets": [
        "Licensed Taekwondo Black Belt Instructor",
        "Trombone player",
        "Rock climbing"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed projects relating to varying tech stacks that promoted learning in full stack development and and Big data",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Munich Re",
      "description": "Designed and implemented queries to pull relevant data from online warehouses into Power BI. Arranged and formatted tables to ensure the information pulled from the data reconciles with deparment standards. Documented query details, design and functionality for future development.",
      "duration": "2021-2021",
      "title": "Underwriting Assistant"
    },
    {
      "company": "HSB BII",
      "description": "Automated business analysis report using VBA scripts. Helped in sorting and analysis of client company transactions. Worked with a team to analyse and automate accounting data reports using Power Query and Power BI Collaborated in a team to design and implement an automated policy pricing tool in VBA and Power Query, and create respective documentation",
      "duration": "2016-2020",
      "title": "Inspection and Claims Adminsitrative assistant"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "JavaScript/Jquery",
      "HTML/CSS",
      "DAX/M",
      "Power BI/Power Query",
      "SAP",
      "R",
      "Haskel",
      "Erlang/Rust/Prolog",
      "Oracle",
      "PSQL",
      "DOCKER",
      "JUNIT"
    ],
    "familiar": [
      "React/React Native",
      "Android studio",
      "Selenium",
      "PHP/ASP",
      "Ruby",
      "Perl",
      "Arduino/Raspberry Pi"
    ],
    "proficient": [
      "Python",
      "C/C++",
      "Visual Basic",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "My name is Amos Pivato, and I am a Toronto Metropolitan University Computer Science graduate with experience working in Data science and automation.  I then discovered the world of AI and machine learning and decided that I wanted to leverage my skills with these tools to help build solutions that could help improve the way we live our everyday lives.  Since then, I've committed myself to always being open to learning anything I can and finding new ways to accomplish tasks more efficiently."
}
